ya940823/STM32-balance-car/I2C_MPU6050.h
#ifndef __MPU6050_H
#define	__MPU6050_H
#include "stm32f10x.h"

/* MPU6050 寄存器地址 */
#define	MPU6050_SMPLRT_DIV		0x19	
#define	MPU6050_CONFIG			  0x1A	
#define	MPU6050_GYRO_CONFIG		0x1B	
#define	MPU6050_ACCEL_CONFIG	0x1C	
#define	MPU6050_ACCEL_XOUT_H	0x3B
#define	MPU6050_ACCEL_XOUT_L	0x3C
#define	MPU6050_ACCEL_YOUT_H	0x3D
#define	MPU6050_ACCEL_YOUT_L	0x3E
#define	MPU6050_ACCEL_ZOUT_H	0x3F
#define	MPU6050_ACCEL_ZOUT_L	0x40
#define	MPU6050_TEMP_OUT_H		0x41
#define	MPU6050_TEMP_OUT_L		0x42
#define	MPU6050_GYRO_XOUT_H		0x43
#define	MPU6050_GYRO_XOUT_L		0x44	
#define	MPU6050_GYRO_YOUT_H		0x45
#define	MPU6050_GYRO_YOUT_L		0x46
#define	MPU6050_GYRO_ZOUT_H		0x47
#define	MPU6050_GYRO_ZOUT_L		0x48
#define	MPU6050_PWR_MGMT_1		0x6B	
#define	MPU6050_WHO_AM_I			0x75	
#define	MPU6050_SlaveAddress	0xD0	


void 	I2C_MPU6050_Init(void);                      // 初始化MPU6050
unsigned int GetData(unsigned char REG_Address);   // 获取MPU6050 数据

#endif 


